In [1]:
import pandas as pd
import numpy as np

In [2]:
temperatures = pd.read_csv("../data/temperatures.csv")

In [3]:
temperatures.head()
temperatures.info()
temperatures.value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16500 entries, 0 to 16499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  16500 non-null  int64
 1   date        16500 non-null  object
 2   city        16500 non-null  object
 3   country     16500 non-null  object
 4   avg_temp_c  16407 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 644.7+ KB

Unnamed: 0  date        city     country        avg_temp_c
0           2000-01-01  Abidjan  Côte D'Ivoire  27.293        1
10829       2008-09-01  Moscow   Russia         10.741        1
10992       2008-07-01  Nagoya   Japan          27.089        1
10993       2008-08-01  Nagoya   Japan          26.974        1
10994       2008-09-01  Nagoya   Japan          23.220        1
                                                             ..
5506        2005-02-01  Harare   Zimbabwe       23.297        1
5507        2005-03-01  Harare   Zimbabwe       22.802        1
5508        2005-04-01  Harare   Zimbabwe       21.280        1
5509        2005-05-01  Harare   Zimbabwe       19.356        1
16498       2013-08-01  Xian     China          24.528        1
Length: 16407, dtype: int64

In [4]:
temp_ind=temperatures.set_index('city')#Move a column from the body of an dataframe to be the index
print(temp_ind)
temp_ind.reset_index(drop=True)

         Unnamed: 0        date        country  avg_temp_c
city
Abidjan           0  2000-01-01  Côte D'Ivoire      27.293
Abidjan           1  2000-02-01  Côte D'Ivoire      27.685
Abidjan           2  2000-03-01  Côte D'Ivoire      29.061
Abidjan           3  2000-04-01  Côte D'Ivoire      28.162
Abidjan           4  2000-05-01  Côte D'Ivoire      27.547
...             ...         ...            ...         ...
Xian          16495  2013-05-01          China      18.979
Xian          16496  2013-06-01          China      23.522
Xian          16497  2013-07-01          China      25.251
Xian          16498  2013-08-01          China      24.528
Xian          16499  2013-09-01          China         NaN

[16500 rows x 4 columns]

       Unnamed: 0        date        country  avg_temp_c
0               0  2000-01-01  Côte D'Ivoire      27.293
1               1  2000-02-01  Côte D'Ivoire      27.685
2               2  2000-03-01  Côte D'Ivoire      29.061
3               3  2000-04-01  Côte D'Ivoire      28.162
4               4  2000-05-01  Côte D'Ivoire      27.547
...           ...         ...            ...         ...
16495       16495  2013-05-01          China      18.979
16496       16496  2013-06-01          China      23.522
16497       16497  2013-07-01          China      25.251
16498       16498  2013-08-01          China      24.528
16499       16499  2013-09-01          China         NaN

[16500 rows x 4 columns]

In [5]:
#indexes make subsetting code cleaner
temperatures[temperatures['city'].isin(['Xian','Mexico'])]
temp_ind.loc[['Xian','Mexico']]#loc filters index values

        Unnamed: 0        date country  avg_temp_c
city
Xian         16335  2000-01-01   China      -2.819
Xian         16336  2000-02-01   China       0.943
Xian         16337  2000-03-01   China       8.997
Xian         16338  2000-04-01   China      13.714
Xian         16339  2000-05-01   China      20.568
...            ...         ...     ...         ...
Mexico       10390  2013-05-01  Mexico      19.155
Mexico       10391  2013-06-01  Mexico      18.924
Mexico       10392  2013-07-01  Mexico      18.091
Mexico       10393  2013-08-01  Mexico      17.882
Mexico       10394  2013-09-01  Mexico      18.313

[330 rows x 4 columns]

In [6]:
#indexing Part2 from Datacamp
cities =['Moscow', 'Saint Petersburg']
print(temperatures[temperatures['city'].isin(cities)])
print(temp_ind.loc[cities])

       Unnamed: 0        date              city country  avg_temp_c
10725       10725  2000-01-01            Moscow  Russia      -7.313
10726       10726  2000-02-01            Moscow  Russia      -3.551
10727       10727  2000-03-01            Moscow  Russia      -1.661
10728       10728  2000-04-01            Moscow  Russia      10.096
10729       10729  2000-05-01            Moscow  Russia      10.357
...           ...         ...               ...     ...         ...
13360       13360  2013-05-01  Saint Petersburg  Russia      12.355
13361       13361  2013-06-01  Saint Petersburg  Russia      17.185
13362       13362  2013-07-01  Saint Petersburg  Russia      17.234
13363       13363  2013-08-01  Saint Petersburg  Russia      17.153
13364       13364  2013-09-01  Saint Petersburg  Russia         NaN

[330 rows x 5 columns]
                  Unnamed: 0        date country  avg_temp_c
city
Moscow                 10725  2000-01-01  Russia      -7.313
Moscow                 10726  2000-02-01  Russia      -3.551
Moscow                 10727  2000-03-01  Russia      -1.661
Moscow                 10728  2000-04-01  Russia      10.096
Moscow                 10729  2000-05-01  Russia      10.357
...                      ...         ...     ...         ...
Saint Petersburg       13360  2013-05-01  Russia      12.355
Saint Petersburg       13361  2013-06-01  Russia      17.185
Saint Petersburg       13362  2013-07-01  Russia      17.234
Saint Petersburg       13363  2013-08-01  Russia      17.153
Saint Petersburg       13364  2013-09-01  Russia         NaN

[330 rows x 4 columns]

In [7]:
#Hierarchical indexes
temps_ind3=temperatures.set_index(['city','country'])
temps_ind3.loc[['Xian','Mexico']]#subset
#subset on inner levels;pass a list of tuples
temps_ind3.loc[[('Xian','China'),('Mexico','Mexico')]]#has to match all of the conditions from the loc

                Unnamed: 0        date  avg_temp_c
city   country
Xian   China         16335  2000-01-01      -2.819
       China         16336  2000-02-01       0.943
       China         16337  2000-03-01       8.997
       China         16338  2000-04-01      13.714
       China         16339  2000-05-01      20.568
...                    ...         ...         ...
Mexico Mexico        10390  2013-05-01      19.155
       Mexico        10391  2013-06-01      18.924
       Mexico        10392  2013-07-01      18.091
       Mexico        10393  2013-08-01      17.882
       Mexico        10394  2013-09-01      18.313

[330 rows x 3 columns]

In [8]:
#Subsetting and using tuples
temperatures_ind = temperatures.set_index(['country','city'])
rows_to_keep = [('Brazil','Rio De Janeiro'),('Pakistan','Lahore')]
print(temperatures_ind.loc[rows_to_keep])

                         Unnamed: 0        date  avg_temp_c
country  city
Brazil   Rio De Janeiro       12540  2000-01-01      25.974
         Rio De Janeiro       12541  2000-02-01      26.699
         Rio De Janeiro       12542  2000-03-01      26.270
         Rio De Janeiro       12543  2000-04-01      25.750
         Rio De Janeiro       12544  2000-05-01      24.356
...                             ...         ...         ...
Pakistan Lahore                8575  2013-05-01      33.457
         Lahore                8576  2013-06-01      34.456
         Lahore                8577  2013-07-01      33.279
         Lahore                8578  2013-08-01      31.511
         Lahore                8579  2013-09-01         NaN

[330 rows x 3 columns]

In [9]:
temps_ind3.sort_index(level=['city','country'], ascending=[True,False])

                       Unnamed: 0        date  avg_temp_c
city    country
Abidjan Côte D'Ivoire           0  2000-01-01      27.293
        Côte D'Ivoire           1  2000-02-01      27.685
        Côte D'Ivoire           2  2000-03-01      29.061
        Côte D'Ivoire           3  2000-04-01      28.162
        Côte D'Ivoire           4  2000-05-01      27.547
...                           ...         ...         ...
Xian    China               16495  2013-05-01      18.979
        China               16496  2013-06-01      23.522
        China               16497  2013-07-01      25.251
        China               16498  2013-08-01      24.528
        China               16499  2013-09-01         NaN

[16500 rows x 3 columns]

print(temp_ind.sort_index())
print(temp_ind.sort_index(level='city'))
print(temp_ind.sort_index(level=['country','city'], ascending=[True, False]))
#Using the level feature allows for specific column sorting

## Slicing and subsetting with .loc and .iloc

In [10]:
temperatures[2:5]#python starts from zero;last digit is not used or accounted for

   Unnamed: 0        date     city        country  avg_temp_c
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [11]:
temps_srt = temperatures.set_index(['country','city']).sort_index()
print(temps_srt)

                    Unnamed: 0        date  avg_temp_c
country     city
Afghanistan Kabul         7260  2000-01-01       3.326
            Kabul         7261  2000-02-01       3.454
            Kabul         7262  2000-03-01       9.612
            Kabul         7263  2000-04-01      17.925
            Kabul         7264  2000-05-01      24.658
...                        ...         ...         ...
Zimbabwe    Harare        5605  2013-05-01      18.298
            Harare        5606  2013-06-01      17.020
            Harare        5607  2013-07-01      16.299
            Harare        5608  2013-08-01      19.232
            Harare        5609  2013-09-01         NaN

[16500 rows x 3 columns]

In [12]:
#Slicing the outer index level(rows)
temps_srt.loc['China':'Mexico']#final value is included

                   Unnamed: 0        date  avg_temp_c
country city
China   Changchun        3135  2000-01-01     -18.759
        Changchun        3136  2000-02-01     -13.105
        Changchun        3137  2000-03-01      -1.089
        Changchun        3138  2000-04-01       7.297
        Changchun        3139  2000-05-01      16.970
...                       ...         ...         ...
Mexico  Mexico          10390  2013-05-01      19.155
        Mexico          10391  2013-06-01      18.924
        Mexico          10392  2013-07-01      18.091
        Mexico          10393  2013-08-01      17.882
        Mexico          10394  2013-09-01      18.313

[8250 rows x 3 columns]

In [13]:
temps_srt.loc[('China','Xian'):('Mexico','Mexico')]#Slicing the inner index levels correctly(rows)

                Unnamed: 0        date  avg_temp_c
country city
China   Xian         16335  2000-01-01      -2.819
        Xian         16336  2000-02-01       0.943
        Xian         16337  2000-03-01       8.997
        Xian         16338  2000-04-01      13.714
        Xian         16339  2000-05-01      20.568
...                    ...         ...         ...
Mexico  Mexico       10390  2013-05-01      19.155
        Mexico       10391  2013-06-01      18.924
        Mexico       10392  2013-07-01      18.091
        Mexico       10393  2013-08-01      17.882
        Mexico       10394  2013-09-01      18.313

[5775 rows x 3 columns]

In [14]:
#Slicing Columns with the appropriate format
temps_srt.loc[:,'date':'avg_temp_c']

                          date  avg_temp_c
country     city
Afghanistan Kabul   2000-01-01       3.326
            Kabul   2000-02-01       3.454
            Kabul   2000-03-01       9.612
            Kabul   2000-04-01      17.925
            Kabul   2000-05-01      24.658
...                        ...         ...
Zimbabwe    Harare  2013-05-01      18.298
            Harare  2013-06-01      17.020
            Harare  2013-07-01      16.299
            Harare  2013-08-01      19.232
            Harare  2013-09-01         NaN

[16500 rows x 2 columns]

In [15]:
temps_srt.loc[('Mexico','Mexico'):('Zimbabwe','Harare'), 'date':'avg_temp_c']
#Slicing both rows and columns with the precises calls

                       date  avg_temp_c
country  city
Mexico   Mexico  2000-01-01      12.694
         Mexico  2000-02-01      14.677
         Mexico  2000-03-01      17.376
         Mexico  2000-04-01      18.294
         Mexico  2000-05-01      18.562
...                     ...         ...
Zimbabwe Harare  2013-05-01      18.298
         Harare  2013-06-01      17.020
         Harare  2013-07-01      16.299
         Harare  2013-08-01      19.232
         Harare  2013-09-01         NaN

[5940 rows x 2 columns]

In [16]:
#Using slicing to subset dataframes
date_temps = temperatures.set_index('date').sort_index()
print(date_temps)

            Unnamed: 0       city        country  avg_temp_c
date
2000-01-01           0    Abidjan  Côte D'Ivoire      27.293
2000-01-01        8415     Lahore       Pakistan      12.792
2000-01-01       15345   Tangshan          China      -5.406
2000-01-01        5115      Gizeh          Egypt      12.669
2000-01-01        8580    Lakhnau          India      15.152
...                ...        ...            ...         ...
2013-09-01       11549    Nanjing          China         NaN
2013-09-01       11714  New Delhi          India         NaN
2013-09-01       11879   New York  United States      17.408
2013-09-01       12209     Peking          China         NaN
2013-09-01       16499       Xian          China         NaN

[16500 rows x 4 columns]

In [17]:
#slicing by date
date_temps.loc['2000-01-01':'2003-01-01']

,Unnamed: 0,city,country,avg_temp_c
date,,,,
2000-01-01,0,Abidjan,Côte D'Ivoire,27.293
2000-01-01,8415,Lahore,Pakistan,12.792
2000-01-01,15345,Tangshan,China,-5.406
2000-01-01,5115,Gizeh,Egypt,12.669
2000-01-01,8580,Lakhnau,India,15.152
...,...,...,...,...
2003-01-01,4161,Dar Es Salaam,Tanzania,28.100
2003-01-01,11256,Nairobi,Kenya,17.316
2003-01-01,15876,Toronto,Canada,-10.128
2003-01-01,2841,Cape Town,South Africa,20.061
2003-01-01,8121,Kinshasa,Congo (Democratic Republic Of The),24.664

In [18]:
#slicing by date-year
date_temps.loc['2000':'2003']

            Unnamed: 0         city        country  avg_temp_c
date
2000-01-01           0      Abidjan  Côte D'Ivoire      27.293
2000-01-01        8415       Lahore       Pakistan      12.792
2000-01-01       15345     Tangshan          China      -5.406
2000-01-01        5115        Gizeh          Egypt      12.669
2000-01-01        8580      Lakhnau          India      15.152
...                ...          ...            ...         ...
2002-12-01        3995       Dalian          China      -2.292
2002-12-01       11420      Nanjing          China       5.284
2002-12-01       15875      Toronto         Canada      -3.920
2002-12-01       13895        Seoul    South Korea       0.205
2002-12-01         200  Addis Abeba       Ethiopia      18.275

[3600 rows x 4 columns]

In [19]:
#slicing in both directions:
temps_srt.loc[('India','Hyderabad'):('Iraq','Baghdad'), 'date':'avg_temp_c']
#Slicing both rows and columns with the precises calls

                         date  avg_temp_c
country city
India   Hyderabad  2000-01-01      23.779
        Hyderabad  2000-02-01      25.826
        Hyderabad  2000-03-01      28.821
        Hyderabad  2000-04-01      32.698
        Hyderabad  2000-05-01      32.438
...                       ...         ...
Iraq    Baghdad    2013-05-01      28.673
        Baghdad    2013-06-01      33.803
        Baghdad    2013-07-01      36.392
        Baghdad    2013-08-01      35.463
        Baghdad    2013-09-01         NaN

[2145 rows x 2 columns]

In [20]:
#Slicing time series
temperatures_bool = temperatures[(temperatures['date'] >= '2010-01-01') & (temperatures['date'] <= '2011-12-31')]
print(temperatures_bool)
#set date as teh index and sort the index
temperatures_ind = temperatures.set_index('date').sort_index()
#Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
print(temperatures_ind.loc['2010':'2011'])

#Use .loc[] to subset temperatures_ind for rows from Aug 2010 to Feb 2011
print(temperatures_ind.loc['2010-08':'2011-02'])

       Unnamed: 0        date     city        country  avg_temp_c
120           120  2010-01-01  Abidjan  Côte D'Ivoire      28.270
121           121  2010-02-01  Abidjan  Côte D'Ivoire      29.262
122           122  2010-03-01  Abidjan  Côte D'Ivoire      29.596
123           123  2010-04-01  Abidjan  Côte D'Ivoire      29.068
124           124  2010-05-01  Abidjan  Côte D'Ivoire      28.258
...           ...         ...      ...            ...         ...
16474       16474  2011-08-01     Xian          China      23.069
16475       16475  2011-09-01     Xian          China      16.775
16476       16476  2011-10-01     Xian          China      12.587
16477       16477  2011-11-01     Xian          China       7.543
16478       16478  2011-12-01     Xian          China      -0.490

[2400 rows x 5 columns]
            Unnamed: 0        city    country  avg_temp_c
date
2010-01-01        4905  Faisalabad   Pakistan      11.810
2010-01-01       10185   Melbourne  Australia      20.016
2010-01-01        3750   Chongqing      China       7.921
2010-01-01       13155   São Paulo     Brazil      23.738
2010-01-01        5400   Guangzhou      China      14.136
...                ...         ...        ...         ...
2010-12-01        6896     Jakarta  Indonesia      26.602
2010-12-01        5246       Gizeh      Egypt      16.530
2010-12-01       11186      Nagpur      India      19.120
2010-12-01       14981      Sydney  Australia      19.559
2010-12-01       13496    Salvador     Brazil      26.265

[1200 rows x 4 columns]
            Unnamed: 0           city        country  avg_temp_c
date
2010-08-01        2602       Calcutta          India      30.226
2010-08-01       12337           Pune          India      24.941
2010-08-01        6562          Izmir         Turkey      28.352
2010-08-01       15637        Tianjin          China      25.543
2010-08-01        9862         Manila    Philippines      27.101
...                ...            ...            ...         ...
2011-01-01        4257  Dar Es Salaam       Tanzania      28.541
2011-01-01       11352        Nairobi          Kenya      17.768
2011-01-01         297    Addis Abeba       Ethiopia      17.708
2011-01-01       11517        Nanjing          China       0.144
2011-01-01       11847       New York  United States      -4.463

[600 rows x 4 columns]

In [22]:
#Get 23rd row, 2nd column (index 22, 1)
print(temperatures.iloc[22,1])
print(temperatures.iloc[:5])

2001-11-01
   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547